app/controllers/member_teams_controller.rb

SELECT "member_teams".* FROM "member_teams"
---
  def index
    @member_teams = MemberTeam.all

INSERT INTO "member_teams" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "asdasdasd"], ["description", "asdasdasd"], ["created_at", "2017-01-03 11:41:19.640091"], ["updated_at", "2017-01-03 11:41:19.640091"]]
---
  def create
    @member_team = MemberTeam.new(member_team_params)

    respond_to do |format|
      if @member_team.save

DELETE FROM "member_teams" WHERE "member_teams"."id" = $1  [["id", 1]]
---
  def destroy
    @member_team.destroy

SELECT  "member_teams".* FROM "member_teams" WHERE "member_teams"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_member_team
      @member_team = MemberTeam.find(params[:id])