app/controllers/opinions_controller.rb

  def index
    @opinions = Opinion.all
---
SELECT "opinions".* FROM "opinions"