app/controllers/product_types_controller.rb

SELECT "product_types".* FROM "product_types"
---
  def index
    @product_types = ProductType.all

SELECT "products".* FROM "products" WHERE "products"."product_type_id" = $1  [["product_type_id", 3]]
---
  def show
    @products = Product.where(product_type_id: @product_type.id)

INSERT INTO "product_types" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Piletas"], ["created_at", "2017-01-02 01:38:00.120360"], ["updated_at", "2017-01-02 01:38:00.120360"]]
---
  def create
    @product_type = ProductType.new(product_type_params)

    respond_to do |format|
      if @product_type.save

DELETE FROM "product_types" WHERE "product_types"."id" = $1  [["id", 1]]
---
  def destroy
    @product_type.destroy

SELECT  "product_types".* FROM "product_types" WHERE "product_types"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_product_type
      @product_type = ProductType.find(params[:id])