app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    @product.product_type_id = @product_type.id
    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "enabled", "product_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["enabled", "f"], ["product_type_id", 3], ["created_at", "2017-01-03 04:00:47.060737"], ["updated_at", "2017-01-03 04:00:47.060737"]]

  def update
    @product.product_type_id = @product_type.id

    respond_to do |format|

      if @product.update(product_params)
---
UPDATE "products" SET "name" = $1, "description" = $2, "price" = $3, "updated_at" = $4 WHERE "products"."id" = $5  [["name", "123asdasdasdasd"], ["description", "asdasdasdasdasdasdasdasd"], ["price", 123.0], ["updated_at", "2017-01-03 04:15:15.648897"], ["id", 2]]

  def destroy

    p = @product.picture

    p.remove_photo!

    @product.destroy
---
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]

    def set_product_type
      @product_type = ProductType.find(params[:product_type_id])
---
SELECT  "product_types".* FROM "product_types" WHERE "product_types"."id" = $1 LIMIT 1  [["id", 3]]